eza
ripgrep
fzf
stow
zsh
neovim
tmux
tree
aria2
cloc
cmake
git-crypt
git-lfs
gnupg
shellcheck
shfmt
wget
curl
make
base-devel
rustup
fnm
uv
