brew "aria2"
brew "astyle"
brew "cling"
brew "cliproxyapi", restart_service: :changed
brew "cloc"
brew "cmake"
brew "colima", restart_service: :changed
brew "croc"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git-crypt"
brew "git-lfs"
brew "llama.cpp"
brew "imagemagick"
brew "jj"
brew "hugo"
brew "mysql"
brew "neovim"
brew "octave"
brew "openclaw-cli"
brew "openjdk@21"
brew "postgresql@18", restart_service: :changed
brew "qrencode"
brew "qt"
brew "redis", restart_service: :changed
brew "rename"
brew "ripgrep"
brew "rust"
brew "scrcpy"
brew "shellcheck"
brew "shfmt"
brew "squashfs"
brew "stow"
brew "subversion"
brew "tectonic"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "xcodegen"
brew "zoxide"
cask "aldente"
cask "android-platform-tools"
cask "android-studio"
cask "antigravity"
cask "applite"
cask "app-tamer"
cask "audacity"
cask "bartender"
cask "beekeeper-studio"
cask "betterdisplay"
cask "beyond-compare"
cask "blender"
cask "blender-benchmark"
cask "brave-browser"
cask "busycal"
cask "cherry-studio"
cask "claude-code"
cask "cleanshot"
cask "comfyui"
cask "cryptomator"
cask "cursor"
cask "daisydisk"
cask "discord"
cask "downie"
cask "drawio"
cask "feishu"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-meslo-for-powerlevel10k"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "jordanbaird-ice"
cask "keka"
cask "keyboard-maestro"
cask "keycastr"
cask "keycue"
cask "maccy"
cask "marta"
cask "microsoft-edge"
cask "miniforge"
cask "moonlight"
cask "motrix"
cask "mweb-pro"
cask "obs"
cask "ocenaudio"
cask "ollama-app"
cask "openclaw"
cask "opencode-desktop"
cask "openmtp"
cask "pdf-expert"
cask "permute"
cask "popclip"
cask "praat"
cask "qt-creator"
cask "soundsource"
cask "stats"
cask "steam"
cask "trae-cn"
cask "utm"
cask "visual-studio-code"
cask "zed"
cask "zotero"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "benjamin-simmonds.pythoncpp-debug"
vscode "bierner.markdown-mermaid"
vscode "bmpenuelas.waveform-render"
vscode "chouzz.vscode-better-align"
vscode "christian-kohler.path-intellisense"
vscode "codeium.codeium"
vscode "codezombiech.gitignore"
vscode "codingq.file-header-comments"
vscode "cschlosser.doxdocgen"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "divyanshuagrawal.competitive-programming-helper"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.code-runner"
vscode "gera2ld.markmap-vscode"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "jackboosy.vcpkg-cmake-tools"
vscode "james-yu.latex-workshop"
vscode "janjoerke.align-by-regex"
vscode "johnstoncode.svn-scm"
vscode "leetcode.vscode-leetcode"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mathworks.language-matlab"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.copilot-mermaid-diagram"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nicoespeon.slides"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sukumo28.wav-preview"
vscode "swiftlang.swift-vscode"
vscode "tboox.xmake-vscode"
vscode "tldraw-org.tldraw-vscode"
vscode "vadimcn.vscode-lldb"
vscode "vintharas.learn-vim"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
