# 新机必装 — 其余的参考 Brewfile 按需手动安装

brew "aria2"
brew "cloc"
brew "cmake"
brew "colima", restart_service: :changed
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git-crypt"
brew "git-lfs"
brew "llama.cpp"
brew "neovim"
brew "redis", restart_service: :changed
brew "rename"
brew "ripgrep"
brew "rust"
brew "scrcpy"
brew "shellcheck"
brew "shfmt"
brew "stow"
brew "subversion"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "xcodegen"
brew "zoxide"

cask "aldente"
cask "android-platform-tools"
cask "betterdisplay"
cask "beyond-compare"
cask "drawio"
cask "font-hack-nerd-font"
cask "font-meslo-for-powerlevel10k"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "jordanbaird-ice"
cask "keka"
cask "maccy"
cask "mweb-pro"
cask "pdf-expert"
cask "popclip"
cask "stats"
cask "visual-studio-code"
